import json

from src.services import profitable_cashbacks



def test_profitable_cashbacks():
    # Пример входных данных
    data = [
        {'Дата платежа': '01.01.2023', 'Категория': 'Продукты', 'Сумма платежа': -1500},
        {'Дата платежа': '15.01.2023', 'Категория': 'Развлечения', 'Сумма платежа': -800},
        {'Дата платежа': '10.02.2023', 'Категория': 'Продукты', 'Сумма платежа': -1200},
        {'Дата платежа': '20.01.2023', 'Категория': 'Продукты', 'Сумма платежа': 500}, # Положительная сумма
        {'Дата платежа': '05.02.2023', 'Категория': 'Развлечения', 'Сумма платежа': -1000}
    ]
    year = '2023'
    month = '1'

    # Вызываем функцию
    result_json = profitable_cashbacks(data, year, month)
    result = json.loads(result_json)

    # Проверяем, что результат - словарь
    assert isinstance(result, dict)

    # Проверяем, что возвращаются только отрицательные значения
    for category, value in result.items():
        assert value is None or value >= 0

    # Проверяем, что ожидаемые категории присутствуют в результате
    assert 'Продукты' in result
    assert 'Развлечения' in result

    # Проверяем ожидаемые значения
    assert result['Продукты'] == 1.5
    assert result['Развлечения'] == 0.8

    # Тест с другими данными
    data2 = [
        {'Дата платежа': '01.03.2024', 'Категория': 'Продукты', 'Сумма платежа': -2000},
        {'Дата платежа': '15.03.2024', 'Категория': 'Развлечения', 'Сумма платежа': -1000}
    ]
    year2 = '2024'
    month2 = '3'
    result_json2 = profitable_cashbacks(data2, year2, month2)
    result2 = json.loads(result_json2)
    assert result2['Продукты'] == 2.0
    assert result2['Развлечения'] == 1.0